WEEKLY_MESSAGE_TEMPLATE = """{date}

Бисмилләһир-Рахмәнир-Рахим!
Алланың ризалығы үшін ғана жамағатпен бірге Жәушан дұғасын оқуға ниет етемін.
Алла Тағала ниетімізді қабыл етсін! Пайғамбарымыз Мұхаммед (саллаллаһу алейһи уа сәлләм) әрқашан: «Робби зидни ъилмән» (Иә, Раббым! Білімімді арттыр!) — деп дұға жасаған. Осы оқыған Жәушанымыз бізге пайдалы білім мен береке әкелсін.

Сделай своих рабов:
{names}
и членов их семей, родственников и близких друзей и всех мумин мусульман угодными и покорными, полностью уповающими на Твою безграничную милость. Дай нам по своей бесконечной щедрости лучше, больше, шире того что мы просим своими ограниченными возможностями. Аминь

اَللّهُمَّ أَصْلِحْ أُمَّةَ مُحَمَّدٍ، اَللّهُمَّ فَرَّجْ عَنْ أُمَّةِ مُحَمَّدٍ ، اَللّهُمَّ ارْحَمْ أُمَّةَ مُحَمَّدٍ

Транслит: [Аллаһумма аслих уммата Мухаммадин, Аллаһумма фарридж ъан уммати Мухаммадин, Аллаһумма-рхам уммата Мухаммад.]

Перевод: О, Алла! Мұхаммедтің үмбетін түзетіп, жақсарт! О, Алла! Мұхаммедтің үмбетін қиындықтардан құтқар! О, Алла! Мұхаммедтің үмбетіне рақым ет, мейіріміңе бөле!
Әумин!
О, Аллах, улучши общину Мухаммада! О, Аллах, избавь (от проблем, трудностей) общину Мухаммада! О, Аллах, помилуй общину Мухаммада!

"""

from datetime import date


def build_weekly_message(
    week_start_date: date,
    names: list[str],
) -> str:
    formatted_date = week_start_date.strftime("%d %B")

    formatted_names = "\n".join(
        names
    )

    return WEEKLY_MESSAGE_TEMPLATE.format(
        date=formatted_date,
        names=formatted_names,
    )